In [1]:
import numpy as np
import pandas as pd

### Liste ile DataFrame Oluşturma :

In [5]:
list1 = [5,10,15,20]

In [13]:
pd.DataFrame(data=list1, columns=["Values"], dtype="float16")

   Values
0     5.0
1    10.0
2    15.0
3    20.0

### NumPy Array ile DataFrame Oluşturma :

In [24]:
np.random.seed(42)
np_array = np.random.randint(0,50,(4,4))

In [26]:
np_array

array([[38, 28, 14, 42],
       [ 7, 20, 38, 18],
       [22, 10, 10, 23],
       [35, 39, 23,  2]])

In [32]:
df = pd.DataFrame(data=np_array,
                  index=["A","B","C","D"],
                 columns=["val1","val2","val3","val4"])

In [35]:
df

   val1  val2  val3  val4
A    38    28    14    42
B     7    20    38    18
C    22    10    10    23
D    35    39    23     2

### Dictionary ile DataFrame Oluşturma :

In [103]:
# Örnek-1:

dict1 = {"AUDI":{"Model":"A3 S-Line","Years":"2017"},
         "Mercedes":{"Model":"E280","Years":"2020"},
         "TOGG":{"Model":"T110","Years":"2024"},
         "Chery":{"Model":"Tiggo 8 Pro Max","Years":"2017"},
}

In [106]:
df_car = pd.DataFrame(dict1).T

In [108]:
df_car

                    Model Years
AUDI            A3 S-Line  2017
Mercedes             E280  2020
TOGG                 T110  2024
Chery     Tiggo 8 Pro Max  2017

In [111]:
# Örnek-2:

np.random.seed(42)
x = np.random.randint(0,50,size = 6)
y = np.random.randint(0,50,size = 6)
z = np.random.randint(0,50,size = 6)
q = np.random.randint(0,50,size = 6)

In [114]:
dict_randint = {"val1":x,
                "val2":y,
                "val3":z,
                "val4":q,
               }

In [117]:
pd.DataFrame(data=dict_randint,index=["line-1","line-2","line-3","line-4","line-5","line-6"])

        val1  val2  val3  val4
line-1    38    38    35    23
line-2    28    18    39    43
line-3    14    22    23    29
line-4    42    10     2    37
line-5     7    10    21     1
line-6    20    23     1    20

### DataFrame'lerin Özelliklerini İnceleme :

In [124]:
df

   val1  val2  val3  val4
A    38    28    14    42
B     7    20    38    18
C    22    10    10    23
D    35    39    23     2

In [127]:
df.head() # head() metodu, default olarak ilk 5 satırı return eder.

   val1  val2  val3  val4
A    38    28    14    42
B     7    20    38    18
C    22    10    10    23
D    35    39    23     2

In [131]:
df.tail() # tail() metodu, default olarak son 5 satırı return eder.

   val1  val2  val3  val4
A    38    28    14    42
B     7    20    38    18
C    22    10    10    23
D    35    39    23     2

In [135]:
df.columns # Sütun bilgisine erişmemizi sağlar.

Index(['val1', 'val2', 'val3', 'val4'], dtype='object')

In [139]:
[i for i in df.columns] # List Comp. içerisinde for loop kullanarak columns ları liste içerisinde return ettik.

['val1', 'val2', 'val3', 'val4']

In [145]:
df.columns = ["Col-1","Col-2","Col-3","Col-4"] # Bu şekilde sütun isimlerini değitirebiliriz.

In [147]:
df

   Col-1  Col-2  Col-3  Col-4
A     38     28     14     42
B      7     20     38     18
C     22     10     10     23
D     35     39     23      2

In [151]:
df.values # df.values ile DF içerisinde yer alan değerleri return ettik.

array([[38, 28, 14, 42],
       [ 7, 20, 38, 18],
       [22, 10, 10, 23],
       [35, 39, 23,  2]])

In [155]:
type(df.values) # DF'i oluşturan value ların veri tipinin,numpy array lerden oluştuğunu gördük.

numpy.ndarray

In [157]:
df.shape # DF'in şekil bilgisini return eder.

(4, 4)

In [159]:
df.ndim # DF'in boyut bilgisini return eder.

2

In [171]:
df.size # DF'i oluşturan değerlerin sayısını return eder.

16